Tekla.Structures.Dialog.UIControls.CreateApplyCancel
The CreateApplyCancel class represents a control including the Create-Apply-Cancel button group.

Tekla.Structures.Dialog.UIControls.CreateApplyCancel.#ctor
Initializes CreateApplyCancel user control.

Tekla.Structures.Dialog.UIControls.CreateApplyCancel.OnLoad(System.EventArgs)
Localizes the control when loaded.
e: The event arguments.

Tekla.Structures.Dialog.UIControls.CreateApplyCancel.CreateClicked
The CreateClicked event is raised when the Create button is clicked.

Tekla.Structures.Dialog.UIControls.CreateApplyCancel.ApplyClicked
The ApplyClicked event is raised when the Apply button is clicked.

Tekla.Structures.Dialog.UIControls.CreateApplyCancel.CancelClicked
The CancelClicked event is raised when the Cancel button is clicked.

Tekla.Structures.Dialog.UIControls.CreateApplyCancel.OnCreateClicked(System.Object,System.EventArgs)
Event handler for Create button's click event.
sender:
e:

Tekla.Structures.Dialog.UIControls.CreateApplyCancel.OnApplyClicked(System.Object,System.EventArgs)
Event handler for Apply button's click event.
sender:
e:

Tekla.Structures.Dialog.UIControls.CreateApplyCancel.OnCancelClicked(System.Object,System.EventArgs)
Event handler for Cancel button's click event.
sender:
e:

Tekla.Structures.Dialog.UIControls.CreateApplyCancel.components
Required designer variable.

Tekla.Structures.Dialog.UIControls.CreateApplyCancel.Dispose(System.Boolean)
Clean up any resources being used.
disposing: true if managed resources should be disposed; otherwise, false.

Tekla.Structures.Dialog.UIControls.CreateApplyCancel.InitializeComponent
Required method for Designer support - do not modify
the contents of this method with the code editor.